/*
Даден е базов абстрактен клас Auto, който съдържа полетата тип на автомобила (лек, товарен).
Съдържа символен низ със съответната дума - марка на автомобила и година на производство.
Инициализиращия конструктор да задава стойност на тези полета чрез параметри.
Реализирайте абстрактен метод за извеждане на съдържанието на обекта в символен низ.
Даден е производен клас на класа Auto - лек автомобил - Car с полета наследени от Auto и
максимална скорост.
Демонстрирайте работата на класовете със създаване на колекция от различен тип автомобили и
извеждане на информация за всички леки автомобили, които са произведени преди 2000 година.
*/
